Repository: jorgelive/AmanecerTours
Catalog: app/locale/*/LC_MESSAGES/default.po
Languages: de_de

# textos_multiples
source: Multitext
de_de: Mehrfachstexte

# galeria_videos
source: Video playlist
de_de: Videogalerie

# panel_adjuntos
source: Attachments panel
de_de: Anlagen

# formulario_contacto
source: Contact form
de_de: kontakt Formular

# message_sent
source: Message was sent
de_de: Die Nachricht wurde geschickt

# message_error_retray
source: There was an error, try again please
de_de: Das war ein Fehler, versuchen sie es nochmal

# message_error
source: There was an error
de_de: Das war ein Fehler

# noticias
source: News
de_de: Nachrichten

# testimonios
source: Testimonies
de_de: Zeugenaussagen

# nombre_required
source: Name is requiered
de_de: Name ist erforderlich

# nombre_max40
source: Maximum name length is 40
de_de: Maximale Namenslänger beträgt 40

# nombre_min7
source: Minimum content length is 7
de_de: Mindest Inhaltslänger beträgt 7

# correo_required
source: E-mail is requiered
de_de: E-Mail Adresse ist erforderlich

# correo_valido
source: E-mail must be valid
de_de: Gültige E-Mail Adresse

# titulo_required
source: Title is requiered
de_de: Überschrift ist erforderlich

# title_max60
source: Maximum title length is 60
de_de: Maximale überschriftslänger beträgt 60

# title_min10
source: Minimum title length is 10
de_de: Mindest Überschriftslänger beträgt 10

# pais_required
source: Country is required
de_de: Land ist erforderlich

# pais_max30
source: Maximum pais length is 30
de_de: Maximale Länger des landes beträgt 30

# pais_min3
source: Minimum content length is 3
de_de: Mindest Landslänger beträgt 3

# contenido_required
source: Content is requiered
de_de: Der Inhalt ist erforderlich

# contenido_max4000
source: Maximum content length is 4000
de_de: Maximale Inhaltslänger beträgt 4000

# contenido_min10
source: Minimum content length is 10
de_de: Mindest Inhaltslänger beträgt 10

# galeria_imagenes
source: Image gallery
de_de: Gallerie Bilder

# panel_promociones
source: On sale
de_de: Angebote

# alerta
source: Alert
de_de: Warnung

# informacion
source: Information
de_de: Auskunft

# mostrar
source: Show
de_de: Zeigen

# informacion_util
source: Useful Information
de_de: Nützliche Informationen

# ocultar
source: Hide
de_de: Verbergen

# correo
source: Mail
de_de: E-mail

# administracion
source: Administration
de_de: Verwaltung

# escoja
source: Choose
de_de: auswählen

# La tabla no exixte
source: Table doesn't exists
de_de: Die Tabelle existiert nicht

source: Error
de_de: Fehler

# dias
source: days
de_de: Tage

# acerca de
source: About
de_de: in Bezug auf

# ver mas
source: Read more
de_de: Mehr anzeigen

# contacto_nombre_apellido
source: Name & surname
de_de: Vorname und Name

# pais
source: Country
de_de: Land

# contacto_email
source: E-mail
de_de: E-Mail Adresse

# contacto_titulo
source: Title
de_de: Überschrift

# contacto_detalle
source: Content
de_de: Bildausschnitt

# contacto_enviar
source: Send
de_de: Senden

# titulo
source: Title
de_de: Überschrift

# fecha
source: Date
de_de: Datum

# nacionalidad
source: Nationality
de_de: Staatsangehörigkeit
